zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg61_cult/support/svd/PIC32CX1025SG61100.svd
               <register>
                  <name>CHPRILVL</name>
                  <description>Channel n Priority Level</description>
                  <addressOffset>0x5</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PRILVL</name>
                        <description>Channel Priority Level</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PRILVLSelect</name>
                           <enumeratedValue>
                              <name>LVL0</name>
                              <description>Channel Priority Level 0 (Lowest Level)</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LVL1</name>
                              <description>Channel Priority Level 1</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LVL2</name>
                              <description>Channel Priority Level 2</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LVL3</name>
                              <description>Channel Priority Level 3 (Highest Level)</description>
                              <value>3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHEVCTRL</name>
                  <description>Channel n Event Control</description>
                  <addressOffset>0x6</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>EVACT</name>
                        <description>Channel Event Input Action</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>EVACTSelect</name>
                           <enumeratedValue>
                              <name>NOACT</name>
                              <description>No action</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRIG</name>
                              <description>Transfer and periodic transfer trigger</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CTRIG</name>
                              <description>Conditional transfer trigger</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CBLOCK</name>
                              <description>Conditional block transfer</description>
                              <value>3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SUSPEND</name>
                              <description>Channel suspend operation</description>
                              <value>4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RESUME</name>
                              <description>Channel resume operation</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SSKIP</name>
                              <description>Skip next block suspend action</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INCPRI</name>
                              <description>Increase priority</description>
                              <value>7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVOMODE</name>
                        <description>Channel Event Output Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EVOMODESelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Block event output selection. Refer to BTCTRL.EVOSEL for available selections.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TRIGACT</name>
                              <description>Ongoing trigger action</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>EVIE</name>
                        <description>Channel Event Input Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EVOE</name>
                        <description>Channel Event Output Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENCLR</name>
                  <description>Channel n Interrupt Enable Clear</description>
                  <addressOffset>0xC</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TERR</name>
                        <description>Channel Transfer Error Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCMPL</name>
                        <description>Channel Transfer Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSP</name>
                        <description>Channel Suspend Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTENSET</name>
                  <description>Channel n Interrupt Enable Set</description>
                  <addressOffset>0xD</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TERR</name>
                        <description>Channel Transfer Error Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCMPL</name>
                        <description>Channel Transfer Complete Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSP</name>
                        <description>Channel Suspend Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHINTFLAG</name>
                  <description>Channel n Interrupt Flag Status and Clear</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TERR</name>
                        <description>Channel Transfer Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCMPL</name>
                        <description>Channel Transfer Complete</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SUSP</name>
                        <description>Channel Suspend</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CHSTATUS</name>
                  <description>Channel n Status</description>
                  <addressOffset>0xF</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PEND</name>
                        <description>Channel Pending</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSY</name>
                        <description>Channel Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FERR</name>
                        <description>Channel Fetch Error</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CRCERR</name>
                        <description>Channel CRC Error</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
