zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg61_cult/support/svd/PIC32CX1025SG61100.svd
               <register>
                  <name>PADCAL</name>
                  <description>USB PAD Calibration</description>
                  <addressOffset>0x28</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>TRANSP</name>
                        <description>USB Pad Transp calibration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>TRANSN</name>
                        <description>USB Pad Transn calibration</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>TRIM</name>
                        <description>USB Pad Trim calibration</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <cluster>
                  <dim>8</dim>
                  <dimIncrement>0x20</dimIncrement>
                  <name>HOST_PIPE[%s]</name>
                  <description/>
                  <addressOffset>0x100</addressOffset>
                  <register>
                     <name>PCFG</name>
                     <description>HOST_PIPE End Point Configuration</description>
                     <addressOffset>0x0</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>PTOKEN</name>
                           <description>Pipe Token</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>2</bitWidth>
                        </field>
                        <field>
                           <name>BK</name>
                           <description>Pipe Bank</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PTYPE</name>
                           <description>Pipe Type</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>3</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>BINTERVAL</name>
                     <description>HOST_PIPE Bus Access Period of Pipe</description>
                     <addressOffset>0x3</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>BITINTERVAL</name>
                           <description>Bit Interval</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>8</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>PSTATUSCLR</name>
                     <description>HOST_PIPE End Point Pipe Status Clear</description>
                     <addressOffset>0x4</addressOffset>
                     <size>8</size>
                     <access>write-only</access>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>DTGL</name>
                           <description>Data Toggle clear</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>CURBK</name>
                           <description>Curren Bank clear</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PFREEZE</name>
                           <description>Pipe Freeze Clear</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK0RDY</name>
                           <description>Bank 0 Ready Clear</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK1RDY</name>
                           <description>Bank 1 Ready Clear</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>PSTATUSSET</name>
                     <description>HOST_PIPE End Point Pipe Status Set</description>
                     <addressOffset>0x5</addressOffset>
                     <size>8</size>
                     <access>write-only</access>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>DTGL</name>
                           <description>Data Toggle Set</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>CURBK</name>
                           <description>Current Bank Set</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PFREEZE</name>
                           <description>Pipe Freeze Set</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK0RDY</name>
                           <description>Bank 0 Ready Set</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK1RDY</name>
                           <description>Bank 1 Ready Set</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>PSTATUS</name>
                     <description>HOST_PIPE End Point Pipe Status</description>
                     <addressOffset>0x6</addressOffset>
                     <size>8</size>
                     <access>read-only</access>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>DTGL</name>
                           <description>Data Toggle</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>CURBK</name>
                           <description>Current Bank</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PFREEZE</name>
                           <description>Pipe Freeze</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK0RDY</name>
                           <description>Bank 0 ready</description>
                           <bitOffset>6</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>BK1RDY</name>
                           <description>Bank 1 ready</description>
                           <bitOffset>7</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>PINTFLAG</name>
                     <description>HOST_PIPE Pipe Interrupt Flag</description>
                     <addressOffset>0x7</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Interrupt Flag</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Interrupt Flag</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL</name>
                           <description>Error Flow Interrupt Flag</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PERR</name>
                           <description>Pipe Error Interrupt Flag</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TXSTP</name>
                           <description>Transmit  Setup Interrupt Flag</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL</name>
                           <description>Stall Interrupt Flag</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>PINTENCLR</name>
                     <description>HOST_PIPE Pipe Interrupt Flag Clear</description>
                     <addressOffset>0x8</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Disable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Disable</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL</name>
                           <description>Error Flow Interrupt Disable</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PERR</name>
                           <description>Pipe Error Interrupt Disable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TXSTP</name>
                           <description>Transmit Setup Interrupt Disable</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL</name>
                           <description>Stall Inetrrupt Disable</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
                  <register>
                     <name>PINTENSET</name>
                     <description>HOST_PIPE Pipe Interrupt Flag Set</description>
                     <addressOffset>0x9</addressOffset>
                     <size>8</size>
                     <resetValue>0x00</resetValue>
                     <fields>
                        <field>
                           <name>TRCPT0</name>
                           <description>Transfer Complete 0 Interrupt Enable</description>
                           <bitOffset>0</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRCPT1</name>
                           <description>Transfer Complete 1 Interrupt Enable</description>
                           <bitOffset>1</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TRFAIL</name>
                           <description>Error Flow Interrupt Enable</description>
                           <bitOffset>2</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>PERR</name>
                           <description>Pipe Error Interrupt Enable</description>
                           <bitOffset>3</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>TXSTP</name>
                           <description>Transmit  Setup Interrupt Enable</description>
                           <bitOffset>4</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                        <field>
                           <name>STALL</name>
                           <description>Stall Interrupt Enable</description>
                           <bitOffset>5</bitOffset>
                           <bitWidth>1</bitWidth>
                        </field>
                     </fields>
                  </register>
               </cluster>
            </cluster>
